Tekla Open API Reference for Tekla Structures 2025
AnalysisLabel Class
 The AnalysisLabel class contains information related to analysis labels.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisLabel
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisLabel
Public NotInheritable Class AnalysisLabel
The AnalysisLabel type exposes the following members.
Constructors
Name | Description
AnalysisLabel
Initializes a new instance of the AnalysisLabel class
Top
Properties
Name | Description
Number
 The number of the analysis label.
Prefix
 The prefix of the analysis label.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace